In [2]:
import pandas as pd
import numpy as np

In [9]:
# Q.2

frames = ['P2010', 'P2011', 'P2012', 'P2013','P2014', 'P2015']
df = pd.DataFrame(np.random.randint(3,100, size=(20,6)), columns = frames)
df.head()

   P2010  P2011  P2012  P2013  P2014  P2015
0     81     42     63     41     58     16
1     40     74     73     87     22     62
2     39      7     65     50     46     62
3     80     78     11     10     77     87
4     45      4     78     18     35     90

In [15]:
df['AVG'] = df[frames].apply(lambda z: np.mean(z), axis=1)
result_df = df.drop(frames, axis=1)
result_df.head()

         AVG
0  50.166667
1  59.666667
2  44.833333
3  57.166667
4  45.000000

In [16]:
# Q.3

df = pd.DataFrame(['A+', 'A', 'A-', 'B+', 'B', 'B-', 'C+', 'C', 'C-', 'D+', 'D'], index=['excellent', 'excellent', 'excellent', 'good', 'good', 'good', 'ok', 'ok', 'ok', 'poor', 'poor'], columns = ['Grades'])
df.head()

          Grades
excellent     A+
excellent      A
excellent     A-
good          B+
good           B

In [17]:
my_categories= pd.CategoricalDtype(categories=['D','D+','C-','C','C+','B-','B','B+','A-','A','A+'], ordered=True)
grades = df['Grades'].astype(my_categories)
result = grades[(grades>'B') & (grades<'A')]

In [18]:
grades

excellent    A+
excellent     A
excellent    A-
good         B+
good          B
good         B-
ok           C+
ok            C
ok           C-
poor         D+
poor          D
Name: Grades, dtype: category
Categories (11, object): [D < D+ < C- < C ... B+ < A- < A < A+]

In [19]:
result

excellent    A-
good         B+
Name: Grades, dtype: category
Categories (11, object): [D < D+ < C- < C ... B+ < A- < A < A+]

In [21]:
# Q.4

src = "/home/maverick/Documents/jupyter notebooks/Coursera Data science specialisation/introduction to data science with pyhton/week 3/dataset/utf-8''cwurData.csv"
df = pd.read_csv(src)
df.head()

,world_rank,institution,country,national_rank,quality_of_education,alumni_employment,quality_of_faculty,publications,influence,citations,broad_impact,patents,score,year
0,1,Harvard University,USA,1,7,9,1,1,1,1,NaN,5,100.00,2012
1,2,Massachusetts Institute of Technology,USA,2,9,17,3,12,4,4,NaN,1,91.67,2012
2,3,Stanford University,USA,3,17,11,5,4,2,2,NaN,15,89.50,2012
3,4,University of Cambridge,United Kingdom,1,10,24,4,16,16,11,NaN,50,86.17,2012
4,5,California Institute of Technology,USA,4,2,29,7,37,22,22,NaN,18,85.21,2012

In [26]:
# Q.5
(pd.Timestamp('11/29/2019') + pd.offsets.MonthEnd()).weekday()

5

In [24]:
pd.Timestamp('11/29/2019')

Timestamp('2019-11-29 00:00:00')

In [27]:
# Q.9
pd.Period('01/12/2019', 'M') + 5

Period('2019-06', 'M')